<a href="https://colab.research.google.com/github/guilhermelaviola/IntelligentDataCollectionAndProcessing/blob/main/IntelligentDataCollectionAndProcessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Intelligent Data Collection and Processing**
A database system relies on solid database design, beginning with conceptual modeling and progressing to relational modeling to structure data effectively. After the necessary tools are installed, developers apply the principles of the SQL language to build and query databases, using features such as complex SQL queries, sorting, grouping, and security mechanisms. In a complete project, SQL is complemented by PL/SQL techniques, which include decision and repetition commands, the creation of procedures, functions, and packages, and the seamless integration of SQL with PL/SQL. Advanced functionalities such as triggers and the use of implicit and explicit cursors enable automation, control, and efficient data manipulation within the database environment.

In [15]:
# Importing all the libraries and resources:
import sqlite3

In [16]:
# Installing MySQL and PostgreSQL:
!apt-get update
!apt-get install -y mysql-server
!service mysql start
!apt-get install postgresql
!service postgresql start

Hit:1 https://cli.github.com/packages stable InRelease
Hit:2 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu2204/x86_64  InRelease
Hit:3 https://cloud.r-project.org/bin/linux/ubuntu jammy-cran40/ InRelease
Hit:4 https://r2u.stat.illinois.edu/ubuntu jammy InRelease
Hit:5 http://archive.ubuntu.com/ubuntu jammy InRelease
Hit:6 http://security.ubuntu.com/ubuntu jammy-security InRelease
Get:7 http://archive.ubuntu.com/ubuntu jammy-updates InRelease [128 kB]
Hit:8 http://archive.ubuntu.com/ubuntu jammy-backports InRelease
Hit:9 https://ppa.launchpadcontent.net/deadsnakes/ppa/ubuntu jammy InRelease
Hit:10 https://ppa.launchpadcontent.net/graphics-drivers/ppa/ubuntu jammy InRelease
Hit:11 https://ppa.launchpadcontent.net/ubuntugis/ppa/ubuntu jammy InRelease
Fetched 128 kB in 1s (93.2 kB/s)
Reading package lists... Done
W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
mysql-server is already the newest version (8.0.44-0ubuntu0.22.04.1).
0 upgraded, 0 newly installed, 0 to remove and 65 not upgraded.
 * Starting MySQL database server mysqld
   ...done.
Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
postgresql is already the newest version (14+238).
0 upgraded, 0 newly installed, 0 to remove and 65 not upgraded.
 * Starting PostgreSQL 14 database server
   ...done.

## **Database System example**

In [17]:
# Creating and querying a simple in-memory SQLite database
conn = sqlite3.connect(":memory:")
cur = conn.cursor()

cur.execute("CREATE TABLE students (id INTEGER PRIMARY KEY, name TEXT, age INT)")
cur.execute("INSERT INTO students (name, age) VALUES ('Alice', 20)")
cur.execute("INSERT INTO students (name, age) VALUES ('Bob', 22)")

conn.commit()

cur.execute("SELECT * FROM students")
cur.fetchall()

[(1, 'Alice', 20), (2, 'Bob', 22)]

## **Database Design system (DDL)**

In [18]:
cur.execute("""
CREATE TABLE departments(
    dept_id INTEGER PRIMARY KEY,
    dept_name TEXT NOT NULL
);

CREATE TABLE employees(
    emp_id INTEGER PRIMARY KEY,
    emp_name TEXT NOT NULL,
    salary REAL,
    dept_id INTEGER,
    FOREIGN KEY(dept_id) REFERENCES departments(dept_id)
);
""")

ProgrammingError: You can only execute one statement at a time.

## **Conceptual Modeling**

## **Relational Modeling**

In [ ]:
cur.executescript('''
CREATE TABLE student(
    student_id INTEGER PRIMARY KEY,
    name TEXT
);
CREATE TABLE course(
    course_id INTEGER PRIMARY KEY,
    title TEXT
);
CREATE TABLE enrollment(
    student_id INTEGER,
    course_id INTEGER,
    grade TEXT,
    PRIMARY KEY(student_id, course_id),
    FOREIGN KEY(student_id) REFERENCES student(student_id),
    FOREIGN KEY(course_id) REFERENCES course(course_id)
);
''')

## **Principles of the SQL language**

In [ ]:
cur.execute("INSERT INTO student VALUES (1, 'Maria')")
cur.execute("SELECT * FROM student WHERE student_id = 1")
cur.fetchall()

## **Practice in a Complete Project**

In [ ]:
# Creating a small database and run operations:
cur.executescript("""
DROP TABLE IF EXISTS product;
CREATE TABLE product(
    id INTEGER PRIMARY KEY,
    name TEXT,
    price REAL,
    quantity INT
);

INSERT INTO product VALUES
(1, 'Keyboard', 150, 20),
(2, 'Mouse', 70, 40),
(3, 'Monitor', 900, 10);
""")

cur.execute("SELECT * FROM product")
cur.fetchall()

## **Complex SQL queries**

In [ ]:
cur.execute("""
SELECT name, price
FROM product
WHERE price > (SELECT AVG(price) FROM product)
ORDER BY price DESC
""")
cur.fetchall()

## **Sorting and grouping**

In [ ]:
cur.execute("""
SELECT dept_id, AVG(salary) AS avg_salary
FROM employees
GROUP BY dept_id
ORDER BY avg_salary DESC
""")
cur.fetchall()

## **Applying Security in SQL via user management for MySQL**

In [ ]:
# SQLite has no user accounts, so here is MySQL example:
CREATE USER 'student'@'localhost' IDENTIFIED BY '1234';
GRANT SELECT, INSERT ON mydb.* TO 'student'@'localhost';
FLUSH PRIVILEGES;

## **PL/SQL and Oracle Features**
PL/SQL is Oracle-specific. SQLite canâ€™t run PL/SQL, but here are the complete runnable examples using Oracle-style syntax for study.

## **PL/SQL Language Techniques, Anonymous Block**

In [ ]:
DECLARE
    v_name VARCHAR2(30) := 'John';
BEGIN
    DBMS_OUTPUT.PUT_LINE('Hello ' || v_name);
END;

## **Decision and repetition commands**

In [ ]:
DECLARE
    v_num NUMBER := 5;
BEGIN
    IF v_num > 3 THEN
        DBMS_OUTPUT.PUT_LINE('Greater than 3');
    END IF;

    FOR i IN 1..5 LOOP
        DBMS_OUTPUT.PUT_LINE('Loop index: ' || i);
    END LOOP;
END;

## **Procedures, functions and packages**

In [ ]:
# Procedure:
CREATE OR REPLACE PROCEDURE add_student(p_id NUMBER, p_name VARCHAR2) AS
BEGIN
    INSERT INTO student(student_id, name) VALUES(p_id, p_name);
END;

# Function:
CREATE OR REPLACE FUNCTION get_total_students RETURN NUMBER AS
    v_total NUMBER;
BEGIN
    SELECT COUNT(*) INTO v_total FROM student;
    RETURN v_total;
END;

## **SQL Integration with PL/SQL**

In [ ]:
DECLARE
    v_count NUMBER;
BEGIN
    SELECT COUNT(*) INTO v_count FROM employees WHERE salary > 5000;
    DBMS_OUTPUT.PUT_LINE('Employees above 5000 salary: ' || v_count);
END;

## **Triggers**

In [ ]:
CREATE OR REPLACE TRIGGER trg_log_update
AFTER UPDATE ON employees
FOR EACH ROW
BEGIN
    INSERT INTO audit_log(emp_id, old_salary, new_salary, change_date)
    VALUES(:OLD.emp_id, :OLD.salary, :NEW.salary, SYSDATE);
END;

## **Implicit and Explicit Cursors**

In [ ]:
# Implicit Cursor:
BEGIN
    UPDATE employees SET salary = salary * 1.1;
    DBMS_OUTPUT.PUT_LINE('Rows updated: ' || SQL%ROWCOUNT);
END;

# Explicit Cursor:
DECLARE
    CURSOR c_emp IS SELECT emp_name, salary FROM employees;
    v_name employees.emp_name%TYPE;
    v_salary employees.salary%TYPE;
BEGIN
    OPEN c_emp;
    LOOP
        FETCH c_emp INTO v_name, v_salary;
        EXIT WHEN c_emp%NOTFOUND;
        DBMS_OUTPUT.PUT_LINE(v_name || ' earns ' || v_salary);
    END LOOP;
    CLOSE c_emp;
END;